// Создаем телеграм-бота с мини игрой для примера работы

// Требуется сам телеграм, в д.с десктопное приложение на компьютере
    // В строке поиска контактов прописываем botfather, выбираем верхнего(BotFather), в появившемся окне переходим по ссылке START(или ЗАПУСТИТЬ), выбираем команду /newbot, вводим название для нового бота (любое, только с окончанием Bot - TestBotFromSinzemBot), 
    // после этого генерируется ссылка на бота, по которой будем его програмировать 
        // Use this token to access the HTTP API: xxxxtokenxxx (сам токен передаем в виде строки)
        

// npm init -y - быстрая инициализация
// npm i node-telegram-bot-api - для работы с телеграмом
// npm i nodemon
// npm i dotenv - помещаем токен доступа в файл .env
    // Прописываем скрипты запуска в package.json
        // В index.js создаем сервер и запускаем(npm run dev)
        // После этого в телеграме переходим по ссылке на бот(t.me/TestFromSinzemBot) и жмем START

// Все работает, но пока запущен сервер. Нужно выгружать на хост

    
